
# Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
# Выведите на экран(в консоль) это слово наоборот.


example = 'Топинамбур'
print(example[0])
print(example[-1])
print(example[(len(example) // 2)::])
print(example[::-1])
print(example[1::2])
